title: Python Py2Exe Image Load
id: cbb56d62-4060-40f7-9466-d8aaf3123f83
status: experimental
description: Detects the image load of Python Core indicative of a Python script bundled with Py2Exe.
references:
  - https://www.py2exe.org/
  - https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
author: Patrick St. John, OTR (Open Threat Research)
date: 2020/05/03
tags:
  - attack.defense_evasion
  - attack.t1045
  - attack.s0053
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 7
    Description: 'Python Core'
  condition: selection
fields:
  - Description
falsepositives:
  - Legit Py2Exe Binaries
level: medium