title: Potential COM hijacking with DelegateExecute
id: 9c5c694b-9246-4888-98b0-1d8933f8b880
description: A General detection to trigger for "DelegateExecute" being set to identify the code that will be invoked by the open command (HKU\Classes\Folder\shell\open\command\) of a COM object.
status: experimental
date: 2020/05/02
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.persistence
    - attack.t1546.015
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/6
    - https://threathunterplaybook.com/evals/apt29/detections/3.B.1_04EB334D-A304-40D9-B177-0BB6E95FC23E.html
    - https://docs.microsoft.com/en-us/windows/win32/shell/launch
    - https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand
    - https://docs.microsoft.com/en-us/windows/win32/shell/shell-and-managed-code
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 13
        TargetObject|endswith: '\shell\open\command\DelegateExecute'
    condition: selection
falsepositives:
    - unknown
level: medium