title: Executable from Webdav
id: aac2fd97-bcba-491b-ad66-a6edf89c71bf
description: "Detects executable access via webdav6. Can be seen in APT 29 such as from the emulated APT 29 hackathon https://github.com/OTRF/detection-hackathon-apt29/"
status: experimental
date: 2020/05/01
author: 'SOC Prime, Adam Swan, OTR (Open Threat Research)'
tags:
    - attack.command_and_control
    - attack.t1571
references:
    - http://carnal0wnage.attackresearch.com/2012/06/webdav-server-to-download-custom.html
    - https://github.com/OTRF/detection-hackathon-apt29
logsource:
  product: zeek
  service: http

detection:
    selection_webdav:
        - useragent: '*WebDAV*'
        - uri: '*webdav*'
    selection_executable:
        - resp_mime_types: '*dosexec*'
        - uri: '*.exe'
    condition: selection_webdav AND selection_executable
falsepositives:
    - unknown
level: medium