title: Potential exfiltration of compressed files
author: Greg Howell, OTR (Open Threat Research)
date: 2020/04/05
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/17
tags:
    - attack.data_exfiltration
    - attack.t1002
    - attack.t1005
    - attack.t1022
logsource:
    product: zeek
    service: files
    service: http
detection:
    selection1:
        uri:
         - '*.7z'
         - '*.zip'
         - '*.rar'
    selection2:
        mime_types: '*compressed'
    selection3:
        filetype: '*compressed'
    selection4:
        http.bodyMagic: '*compressed'
    selection5:
        http.method: PUT
    condition: selection1 and selection2 and selection5 or selection3 and selection5 or selection4 and selection5
falsepositives:
    - nothing observed so far
level: medium
